//Напишите программу, которая будет выдавать название дня недели по заданному номеру.
  //     3 -> Среда
    //   5 -> Пятница

string name = "Петя";

switch (name)
{
    case "Валера":
        Console.WriteLine("Первое приветствие...");
        break;
    case "Петя":
        Console.WriteLine("Второе приветствие...");
        break;
    default:
        Console.WriteLine("Обычное приветствие...");
        break;
}
